nc: 13  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 3

# YOLOv3-tiny backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Silence, []],  # 0
   [-1, 1, Conv_1, [64, 7, 2]],  # 1
   [-1, 1, BasicBlock_2, [64,3, 2]], #2
   [-1, 1, Concat_res2, [128, 3, 2]], #3
   [-1, 1, Concat_res2, [256, 3, 2]], #4
   [-1, 1, Concat_res2, [512, 3, 2]], #5
  ]

# YOLOv3-tiny head
head:
  [[-1, 1, BasicBlock_1, [256, 1]], #6
   [-1, 1, BasicBlock_2, [512, 3, 1]],  # 7 (P5/32-large)

   [-2, 1, BasicBlock_2, [128, 1, 1]], #8
   [-1, 1, Sample, [None, 2, 'nearest']],#9
   [[-1, 4], 1, Concat, [2]],  # cat backbone P4
   [-1, 1, BasicBlock_2, [256, 3, 1]],  # 11 (P4/16-medium)

   [ -1, 1, BasicBlock_2, [ 64, 1, 1 ] ], #12
   [ -1, 1, Sample, [ None, 2, 'nearest' ] ],#13
   [[ -1, 3], 1, Concat, [ 2 ] ],  # cat backbone P3
   [ -1, 1, BasicBlock_2, [ 128, 3, 1 ] ],  # 15 (P3/8-small)

   [3, 1, CBLinear, [[128]]], # 16
   [4, 1, CBLinear, [[128,256]]], # 17
   [5, 1, CBLinear, [[128,256,512]]], # 18

   [0, 1, Conv_1, [64, 7, 2]],  # 19
   [-1, 1, BasicBlock_2, [ 64,3, 2 ] ], #20
   [-1, 1, Concat_res2, [128, 3, 2 ] ], #21

   [[16, 17, 18, -1], 1, CBFuse, [[0, 0, 0]]], # 22

   [-1, 1, Concat_res2, [256, 3, 2]], #23

   [[17, 18, -1], 1, CBFuse, [[1, 1]]], # 24

   [-1, 1, Concat_res2, [512, 3, 2]], #25

   [[18, -1], 1, CBFuse, [[2]]], # 26

   [[22, 24, 26, 15, 11, 7], 1, DualDDetect, [nc]],  # Detect(A4, A5, P4, P5)
  ]