nc: 13  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [ 10,13, 16,30, 33,23 ]  # P3/8
  - [ 30,61, 62,45, 59,119 ]  # P4/16
  - [ 116,90, 156,198, 373,326 ]  # P5/32

# YOLOv3-tiny backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv_1, [64, 7, 2]],  # 0 P1/2
   [-1, 1, BasicBlock_2, [64,3, 2]], #1 P2/4
   [-1, 1, Concat_res2, [128, 3, 2]], #2 P3/8
   [-1, 1, Concat_res2, [256, 3, 2]], #3 P4/16
   [-1, 1, Concat_res2, [512, 3, 2]], #4 P5/32
  ]


# YOLOv3-tiny head
head:
  [[[1, 2, 3, 4], 1, SimFusion_4in, []], # 5
   [-1, 1, IFM, [[64, 32]]], # 6

   [4, 1, Conv, [512, 1, 1]], # 7
   [[2, 3, -1], 1, SimFusion_3in, [512]], # 8
   [[-1, 6], 1, InjectionMultiSum_Auto_pool, [512, [64, 32], 0]], # 9
   [-1, 3, C3, [512, False]], # 10

   [3, 1, Conv, [256, 1, 1]], # 11
   [[2, 4, -1], 1, SimFusion_3in, [256]], # 12
   [[-1, 6], 1, InjectionMultiSum_Auto_pool, [256, [64, 32], 1]], # 13
   [-1, 3, C3, [256, False]], # 14

   [[14, 10, 4], 1, PyramidPoolAgg, [352, 2]], # 15
   [-1, 1, TopBasicLayer, [352, [64, 128]]], # 16

   [[14, 11], 1, AdvPoolFusion, []], # 17
   [[-1, 16], 1, InjectionMultiSum_Auto_pool, [256, [64, 128], 0]], # 18
   [-1, 3, C3, [256, False]], # 19

   [[-1, 7], 1, AdvPoolFusion, []], # 20
   [[-1, 16], 1, InjectionMultiSum_Auto_pool, [512, [64, 128], 1]], # 21
   [-1, 3, C3, [512, False]], # 22

   [[14, 19, 22], 1, Detect, [nc, anchors]] # 23
  ]