nc: 13  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [ 10,13, 16,30, 33,23 ]  # P3/8
  - [ 30,61, 62,45, 59,119 ]  # P4/16
  - [ 116,90, 156,198, 373,326 ]  # P5/32

# YOLOv3-tiny backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv_1, [64, 7, 2]],  # 0 P1/2
   [-1, 1, BasicBlock_2, [64,3, 2]], #1 P2/4
   [-1, 1, Concat_res2, [128, 3, 2]], #2 P3/8
   [-1, 1, Concat_res2, [256, 3, 2]], #3 P4/16
   [-1, 1, Concat_res2, [512, 3, 2]], #4 P5/32
  ]

# YOLOv3-tiny head
head:
  [[-1, 1, BasicBlock_1, [256, 1]], #5
   [-1, 1, BasicBlock_2, [512, 3, 1]],  # 6 (P5/32-large)

   [-2, 1, BasicBlock_2, [128, 1, 1]], #7
   [-1, 1, Sample, [None, 2, 'nearest']],#8
   [[-1, 3], 1, Concat, [2]],  # cat backbone P4
   [-1, 1, BasicBlock_2, [256, 3, 1]],  # 10 (P4/16-medium)

   [-1, 1, BasicBlock_2, [64, 1, 1]], #11
   [-1, 1, Sample, [None, 2, 'nearest']],#12
   [[-1, 2 ], 1, Concat, [2]],  # cat backbone P3
   [-1, 1, BasicBlock_2, [128, 3, 1]],  # 14 (P3/8-small)

   [[14, 10, 6], 1, Detect, [nc, anchors]],  # Detect(P4, P5)
  ]