nc: 13  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors: 3

# YOLOv3-tiny backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv_1, [64, 7, 2]],  # 0 P1/2
   [-1, 1, BasicBlock_2, [64,3, 2]], #1 P2/4
   [-1, 1, Concat_res2, [128, 3, 2]], #2 P3/8
   [-1, 1, Concat_res2, [256, 3, 2]], #3 P4/16
   [-1, 1, Concat_res2, [512, 3, 2]], #4 P5/32
  ]


# YOLOv3-tiny head
head:
  [[-1, 1, BasicBlock_1, [256, 1]], #5
    [-1, 1, Sample, [None, 2, 'nearest']], #6
    [[-1, 3], 1, ContextGuideFusionModule, [2]],  # cat backbone P4
    [-1, 1, BasicBlock_2, [256, 3, 1]],  # 8 (P4/16-large)

    [-1, 1, BasicBlock_1, [128, 1]], #9
    [-1, 1, Sample, [ None, 2, 'nearest']],#10
    [[-1, 2], 1, ContextGuideFusionModule, [2]],  # cat backbone P4
    [-1, 1, BasicBlock_2, [128, 3, 1]],  # 12 (P3/8-medium)

    [-1, 1, BasicBlock_2, [128, 3, 2]], #13
    [[-1, 9], 1, ContextGuideFusionModule, [2]], #14
    [-1, 1, BasicBlock_2, [256, 3, 1]], #15 (P4/16-medium)

    [-1, 1, BasicBlock_2, [256, 3, 2]], #16
    [[-1, 5], 1, ContextGuideFusionModule, [2]], #17
    [-1, 1, BasicBlock_2, [512, 3, 1]], #18 (P5/32-large)

    [[12, 15, 18], 1, DDetect, [nc]],  # Detect(P3, P4, P5)
  ]