# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 13 # number of classes
depth_multiple: 0.33 # model depth multiple
width_multiple: 0.50 # layer channel multiple
anchors: 3

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv_1, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv_3, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv_3, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],
   [-1, 1, Conv_3, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv_3, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv_4, [512, 1, 1]],
   [-1, 1, Sample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [2]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv_4, [256, 1, 1]],
   [-1, 1, Sample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [2]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv_4, [256, 3, 2]],
   [[-1, 14], 1, Concat, [2]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv_4, [512, 3, 2]],
   [[-1, 10], 1, Concat, [2]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, DDetect, [nc]],  # Detect(P3, P4, P5)
  ]
